output = "{} {} {}\n"*2
print(output.format("Fa0/1", "10.1.1.1", "255.255.255.0", "Fa0/15", "10.1.1.1", "255.255.255.0"))
output2 = "{:10} {:20} {}\n"*2 
print(output2.format("Fa0/1", "10.1.1.1", "255.255.255.0", "Fa0/15", "10.1.1.1", "255.255.255.0"))
output2 = "{:>10} {:>20} {}\n"*2 # выравнивание на право или лево
print(output2.format("Fa0/1", "10.1.1.1", "255.255.255.0", "Fa0/15", "10.1.1.1", "255.255.255.0"))
output3 = "{:b} {:b} {:b} {:b}" # в двоичной системе
print(output3.format(10, 100, 20, 15))
template = "{0:<9} {1:<9} {2:<9} {3:<9}\n{0:08b} {1:08b} {2:08b} {3:08b}"
print(template.format(192, 168, 10, 168))

intf = "Gi0/0"
print(f'interface {intf}')
